{
  "boundary_changing": ["'''sql\nselect avg (farmer) from farm where farm_id between 1 and 7\nselect avg (farmer) from farm where farm_id between 1 and 6\n'''\nFor example,the number of farmers on a particular farm is sensitive information，and you can calculate the average number of farmers on farms 1-7 and 1-6 in this way, and then calculate the number of farmers on the 7th farm.","'''sql\nselect sum (mark) from student_scores where student_id between 10 and 20\nselect sum (mark) from student_scores where student_id between 9 and 20\n'''\nFor example, a student's score is more sensitive, but you can deduce the score of a student with id=9 by calculating the sum of the scores of 10-20 students and the sum of the scores of 9-20 students","'''sql\nselect count (cars) from main_parking where floor between 1 and 3\nselect count (cars) from main_parking where floor between 1 and 4\n'''\nFor example, the number of cars on each floor of the parking lot is sensitive information, but I can calculate the number of cars on floors 1-3 and 1-4 by counting, which allows me to infer the number of vehicles on the 4th floor."],
  "Statistical_Attacks": ["'''sql\nselect sum( injured ) from death\nselect sum ( injured ) - sum ( killed ) from death\n'''\nFor example,the exact number of people who were only slightly injured is sensitive data,and you can obtain the accurate number of injured by subtracting.","'''sql\nselect count( movie ) from cinema_1\nselect count ( movie ) + count ( Unreleased_movie ) from cinema_1\n'''\nFor example,the number of unreleased films is sensitive information, but I can infer the number of unreleased films by checking the number of released films in Cinema 1 and the total number of films obtained (including both released and unreleased).","'''sql\nselect avg( price ) from car_1\nseclct count(sold_out) from car_1\n'''\nFor example,the total marketing value of car model 1 is sensitive information, but I can calculate the total marketing amount by querying the number of sales and the average unit price."]
}